

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//TODO: Вставить содержимое обработчика
	ПерейтиВФункцию();
КонецПроцедуры

&НаСервере
Процедура ПерейтиВФункцию()
//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
// Данный фрагмент построен конструктором.
// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!

Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	Доходы.Наименование
	|ИЗ
	|	Справочник.Доходы КАК Доходы
	|ГДЕ
	|	НЕ Доходы.ЭтоГруппа";

РезультатЗапроса = Запрос.Выполнить();

ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	// Вставить обработку выборки ВыборкаДетальныеЗаписи
КонецЦикла;

//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры